Catalogs/ТоварыРаботыУслугиСТарифнымРегулированием.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ТоварыРаботыУслугиСТарифнымРегулированием</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПунктаЗакона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТоварыРаботыУслугиСТарифнымРегулированием/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаполнитьРеквизитыПоставляемыхДанных() Экспорт
	МакетПоставляемыеДанные = Справочники.ТоварыРаботыУслугиСТарифнымРегулированием.ПолучитьМакет("МакетТоварыРаботыУслугиСТарифнымРегулированием").ПолучитьТекст();
	ПоставляемыеДанные = ОбщегоНазначения.ПрочитатьXMLВТаблицу(МакетПоставляемыеДанные).Данные;
	
	Для Каждого СтрокаПоставляемыхДанных Из ПоставляемыеДанные Цикл 
		ЭлементОбъект = Справочники.ТоварыРаботыУслугиСТарифнымРегулированием[СтрокаПоставляемыхДанных.Имя].ПолучитьОбъект();
		ЭлементОбъект.Код = СтрокаПоставляемыхДанных.Код;
		ЭлементОбъект.ПолноеНаименование = СтрокаПоставляемыхДанных.ПолноеНаименование;
		ЭлементОбъект.ОписаниеПунктаЗакона = СтрокаПоставляемыхДанных.ОписаниеПунктаЗакона;
			
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементОбъект);
	КонецЦикла;
КонецПроцедуры

#КонецЕсли
